sims/trapped_water/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.8
// Source file: /home/da/blender_openfoam_test/piston_water.blend1
// Export date: 2025-01-31 13:19:11.085086

convertToMeters 0.01;

vertices
(
    ( -4.1 -4.1 -0.1 )
    ( 4.1 -4.1 -0.1 )
    ( 4.1 4.1 -0.1 )
    ( -4.1 4.1 -0.1 )
    ( -4.1 -4.1 10.6 )
    ( 4.1 -4.1 10.6 ) 
    ( 4.1 4.1 10.6 ) 
    ( -4.1 4.1 10.6 ) 
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (82 82 107) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    world
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);
