sims/trapped_water/0/piston/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0/piston";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    piston_to_surronding_air
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0);
    }
    piston_to_water
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
