sims/trapped_water/0/surronding_air/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0/surronding_air";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    world
    {
        type            noSlip;
        value           uniform ( 0 0 0 );
    }
    surronding_air_to_piston
    {
        type            noSlip;
        value           uniform ( 0 0 0 );
    }
    surronding_air_to_water
    {
        type            noSlip;
        value           uniform ( 0 0 0 );
    }
    minX
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    maxX
    {
        type            inletOutlet;
        inletValue      uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
