sims/trapped_water/0/water/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0/water";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    water_to_piston
    {
        type            noSlip;
        value           uniform ( 0 0 0 );
    }
    water_to_surronding_air
    {
        type            noSlip;
        value           uniform ( 0 0 0 );
    }
    minX
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    maxX
    {
        type            inletOutlet;
        inletValue      uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
