sims/trapped_water/0/surronding_air/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/surronding_air";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    world
    {
        type            calculated;
        value           uniform 0;
    }
    surronding_air_to_piston
    {
        type            calculated;
        value           uniform 0;
    }
    surronding_air_to_water
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
