sims/trapped_water/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.8
// Source file: /home/da/blender_openfoam_test/piston_water.blend1
// Export date: 2025-01-31 13:19:11.085232

numberOfSubdomains 8;

method          scotch;
// method          simple;

simpleCoeffs
{
    n               (1 1 8);
    delta           0.001;
}

hierarchicalCoeffs
{
    n               (1 1 8);
    delta           0.001;
    order           xyz;
}

manualCoeffs
{
    dataFile        "cellDecomposition";
}
