sims/trapped_water/system/piston/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


T
{
    //internalField   uniform 400;

    boundaryField
    {
/*    
        minY
        {
            type            fixedValue;
            value           uniform 400;
        }

        maxY
        {
            type            fixedValue;
//            inletValue      uniform 300;
            value           uniform 400;
        }

        ".*"
        {
            type            zeroGradient;
            //value           uniform 300;
        }
*/
        ".*"
        {
            type            zeroGradient;
        }      

        "piston_to.*"
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;
            Tnbr            T;
            kappaMethod     solidThermo;
            value           uniform 300;
        }
    }
}


p
{
    internalField   uniform 0;

    boundaryField
    {
        ".*"
        {
            type            calculated;
            value           uniform 0;
        }
    }
}

// ************************************************************************* //
