sims/trapped_water/system/surfaceFeaturesDict
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          surfaceFeaturesDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.8
// Source file: /home/da/blender_openfoam_test/piston_water.blend1
// Export date: 2025-01-31 13:19:11.085017



surfaces
(
    "piston.stl"
    "water.stl"
);

includedAngle 150;
writeObj yes;


